espressif/esp-idf/components/soc/esp32h21/register/soc/hp_apm_struct.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: Region filter enable register */
/** Type of apm_region_filter_en register
 *  Region filter enable register
 */
typedef union {
    struct {
        /** apm_region_filter_en : R/W; bitpos: [15:0]; default: 1;
         *  Region filter enable
         */
        uint32_t apm_region_filter_en:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} hp_apm_region_filter_en_reg_t;


/** Group: Region address register */
/** Type of apm_region0_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region0_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region0
         */
        uint32_t apm_region0_addr_start:32;
    };
    uint32_t val;
} hp_apm_region0_addr_start_reg_t;

/** Type of apm_region0_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region0_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region0
         */
        uint32_t apm_region0_addr_end:32;
    };
    uint32_t val;
} hp_apm_region0_addr_end_reg_t;

/** Type of apm_region1_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region1_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region1
         */
        uint32_t apm_region1_addr_start:32;
    };
    uint32_t val;
} hp_apm_region1_addr_start_reg_t;

/** Type of apm_region1_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region1_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region1
         */
        uint32_t apm_region1_addr_end:32;
    };
    uint32_t val;
} hp_apm_region1_addr_end_reg_t;

/** Type of apm_region2_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region2_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region2
         */
        uint32_t apm_region2_addr_start:32;
    };
    uint32_t val;
} hp_apm_region2_addr_start_reg_t;

/** Type of apm_region2_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region2_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region2
         */
        uint32_t apm_region2_addr_end:32;
    };
    uint32_t val;
} hp_apm_region2_addr_end_reg_t;

/** Type of apm_region3_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region3_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region3
         */
        uint32_t apm_region3_addr_start:32;
    };
    uint32_t val;
} hp_apm_region3_addr_start_reg_t;

/** Type of apm_region3_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region3_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region3
         */
        uint32_t apm_region3_addr_end:32;
    };
    uint32_t val;
} hp_apm_region3_addr_end_reg_t;

/** Type of apm_region4_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region4_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region4
         */
        uint32_t apm_region4_addr_start:32;
    };
    uint32_t val;
} hp_apm_region4_addr_start_reg_t;

/** Type of apm_region4_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region4_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region4
         */
        uint32_t apm_region4_addr_end:32;
    };
    uint32_t val;
} hp_apm_region4_addr_end_reg_t;

/** Type of apm_region5_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region5_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region5
         */
        uint32_t apm_region5_addr_start:32;
    };
    uint32_t val;
} hp_apm_region5_addr_start_reg_t;

/** Type of apm_region5_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region5_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region5
         */
        uint32_t apm_region5_addr_end:32;
    };
    uint32_t val;
} hp_apm_region5_addr_end_reg_t;

/** Type of apm_region6_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region6_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region6
         */
        uint32_t apm_region6_addr_start:32;
    };
    uint32_t val;
} hp_apm_region6_addr_start_reg_t;

/** Type of apm_region6_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region6_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region6
         */
        uint32_t apm_region6_addr_end:32;
    };
    uint32_t val;
} hp_apm_region6_addr_end_reg_t;

/** Type of apm_region7_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region7_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region7
         */
        uint32_t apm_region7_addr_start:32;
    };
    uint32_t val;
} hp_apm_region7_addr_start_reg_t;

/** Type of apm_region7_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region7_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region7
         */
        uint32_t apm_region7_addr_end:32;
    };
    uint32_t val;
} hp_apm_region7_addr_end_reg_t;

/** Type of apm_region8_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region8_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region8
         */
        uint32_t apm_region8_addr_start:32;
    };
    uint32_t val;
} hp_apm_region8_addr_start_reg_t;

/** Type of apm_region8_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region8_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region8
         */
        uint32_t apm_region8_addr_end:32;
    };
    uint32_t val;
} hp_apm_region8_addr_end_reg_t;

/** Type of apm_region9_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region9_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region9
         */
        uint32_t apm_region9_addr_start:32;
    };
    uint32_t val;
} hp_apm_region9_addr_start_reg_t;

/** Type of apm_region9_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region9_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region9
         */
        uint32_t apm_region9_addr_end:32;
    };
    uint32_t val;
} hp_apm_region9_addr_end_reg_t;

/** Type of apm_region10_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region10_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region10
         */
        uint32_t apm_region10_addr_start:32;
    };
    uint32_t val;
} hp_apm_region10_addr_start_reg_t;

/** Type of apm_region10_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region10_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region10
         */
        uint32_t apm_region10_addr_end:32;
    };
    uint32_t val;
} hp_apm_region10_addr_end_reg_t;

