espressif/esp-idf/components/soc/esp32h21/register/soc/hp_apm_struct.h
/** Type of apm_region11_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region11_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region11
         */
        uint32_t apm_region11_addr_start:32;
    };
    uint32_t val;
} hp_apm_region11_addr_start_reg_t;

/** Type of apm_region11_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region11_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region11
         */
        uint32_t apm_region11_addr_end:32;
    };
    uint32_t val;
} hp_apm_region11_addr_end_reg_t;

/** Type of apm_region12_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region12_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region12
         */
        uint32_t apm_region12_addr_start:32;
    };
    uint32_t val;
} hp_apm_region12_addr_start_reg_t;

/** Type of apm_region12_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region12_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region12
         */
        uint32_t apm_region12_addr_end:32;
    };
    uint32_t val;
} hp_apm_region12_addr_end_reg_t;

/** Type of apm_region13_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region13_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region13
         */
        uint32_t apm_region13_addr_start:32;
    };
    uint32_t val;
} hp_apm_region13_addr_start_reg_t;

/** Type of apm_region13_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region13_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region13
         */
        uint32_t apm_region13_addr_end:32;
    };
    uint32_t val;
} hp_apm_region13_addr_end_reg_t;

/** Type of apm_region14_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region14_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region14
         */
        uint32_t apm_region14_addr_start:32;
    };
    uint32_t val;
} hp_apm_region14_addr_start_reg_t;

/** Type of apm_region14_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region14_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region14
         */
        uint32_t apm_region14_addr_end:32;
    };
    uint32_t val;
} hp_apm_region14_addr_end_reg_t;

/** Type of apm_region15_addr_start register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region15_addr_start : R/W; bitpos: [31:0]; default: 0;
         *  Start address of region15
         */
        uint32_t apm_region15_addr_start:32;
    };
    uint32_t val;
} hp_apm_region15_addr_start_reg_t;

/** Type of apm_region15_addr_end register
 *  Region address register
 */
typedef union {
    struct {
        /** apm_region15_addr_end : R/W; bitpos: [31:0]; default: 4294967295;
         *  End address of region15
         */
        uint32_t apm_region15_addr_end:32;
    };
    uint32_t val;
} hp_apm_region15_addr_end_reg_t;


/** Group: Region access authority attribute register */
/** Type of apm_region0_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** apm_region0_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t apm_region0_r0_pms_x:1;
        /** apm_region0_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t apm_region0_r0_pms_w:1;
        /** apm_region0_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t apm_region0_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** apm_region0_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t apm_region0_r1_pms_x:1;
        /** apm_region0_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t apm_region0_r1_pms_w:1;
        /** apm_region0_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t apm_region0_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** apm_region0_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t apm_region0_r2_pms_x:1;
        /** apm_region0_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t apm_region0_r2_pms_w:1;
        /** apm_region0_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t apm_region0_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region0_pms_attr_reg_t;

/** Type of apm_region1_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** apm_region1_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t apm_region1_r0_pms_x:1;
        /** apm_region1_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t apm_region1_r0_pms_w:1;
        /** apm_region1_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t apm_region1_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** apm_region1_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t apm_region1_r1_pms_x:1;
        /** apm_region1_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t apm_region1_r1_pms_w:1;
        /** apm_region1_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t apm_region1_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** apm_region1_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t apm_region1_r2_pms_x:1;
        /** apm_region1_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t apm_region1_r2_pms_w:1;
        /** apm_region1_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t apm_region1_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region1_pms_attr_reg_t;

/** Type of apm_region2_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** apm_region2_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t apm_region2_r0_pms_x:1;
        /** apm_region2_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t apm_region2_r0_pms_w:1;
        /** apm_region2_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t apm_region2_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** apm_region2_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t apm_region2_r1_pms_x:1;
        /** apm_region2_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t apm_region2_r1_pms_w:1;
        /** apm_region2_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t apm_region2_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** apm_region2_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t apm_region2_r2_pms_x:1;
        /** apm_region2_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t apm_region2_r2_pms_w:1;
        /** apm_region2_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t apm_region2_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region2_pms_attr_reg_t;

/** Type of apm_region3_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** apm_region3_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t apm_region3_r0_pms_x:1;
        /** apm_region3_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t apm_region3_r0_pms_w:1;
        /** apm_region3_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t apm_region3_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** apm_region3_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t apm_region3_r1_pms_x:1;
        /** apm_region3_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t apm_region3_r1_pms_w:1;
        /** apm_region3_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t apm_region3_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** apm_region3_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t apm_region3_r2_pms_x:1;
        /** apm_region3_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t apm_region3_r2_pms_w:1;
        /** apm_region3_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t apm_region3_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region3_pms_attr_reg_t;

/** Type of apm_region4_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** apm_region4_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t apm_region4_r0_pms_x:1;
        /** apm_region4_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t apm_region4_r0_pms_w:1;
        /** apm_region4_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t apm_region4_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** apm_region4_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t apm_region4_r1_pms_x:1;
        /** apm_region4_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t apm_region4_r1_pms_w:1;
        /** apm_region4_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t apm_region4_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** apm_region4_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t apm_region4_r2_pms_x:1;
        /** apm_region4_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t apm_region4_r2_pms_w:1;
        /** apm_region4_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t apm_region4_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region4_pms_attr_reg_t;

/** Type of apm_region5_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** apm_region5_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t apm_region5_r0_pms_x:1;
        /** apm_region5_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t apm_region5_r0_pms_w:1;
        /** apm_region5_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t apm_region5_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** apm_region5_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t apm_region5_r1_pms_x:1;
        /** apm_region5_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t apm_region5_r1_pms_w:1;
        /** apm_region5_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t apm_region5_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** apm_region5_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t apm_region5_r2_pms_x:1;
        /** apm_region5_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t apm_region5_r2_pms_w:1;
        /** apm_region5_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t apm_region5_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region5_pms_attr_reg_t;

/** Type of apm_region6_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** apm_region6_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t apm_region6_r0_pms_x:1;
        /** apm_region6_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t apm_region6_r0_pms_w:1;
        /** apm_region6_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t apm_region6_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** apm_region6_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t apm_region6_r1_pms_x:1;
        /** apm_region6_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t apm_region6_r1_pms_w:1;
        /** apm_region6_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t apm_region6_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** apm_region6_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t apm_region6_r2_pms_x:1;
        /** apm_region6_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t apm_region6_r2_pms_w:1;
        /** apm_region6_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t apm_region6_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region6_pms_attr_reg_t;

/** Type of apm_region7_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** apm_region7_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t apm_region7_r0_pms_x:1;
        /** apm_region7_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t apm_region7_r0_pms_w:1;
        /** apm_region7_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t apm_region7_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** apm_region7_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t apm_region7_r1_pms_x:1;
        /** apm_region7_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t apm_region7_r1_pms_w:1;
        /** apm_region7_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t apm_region7_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** apm_region7_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t apm_region7_r2_pms_x:1;
        /** apm_region7_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t apm_region7_r2_pms_w:1;
        /** apm_region7_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t apm_region7_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region7_pms_attr_reg_t;

/** Type of apm_region8_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** apm_region8_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t apm_region8_r0_pms_x:1;
        /** apm_region8_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t apm_region8_r0_pms_w:1;
        /** apm_region8_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t apm_region8_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** apm_region8_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t apm_region8_r1_pms_x:1;
        /** apm_region8_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t apm_region8_r1_pms_w:1;
        /** apm_region8_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t apm_region8_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** apm_region8_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t apm_region8_r2_pms_x:1;
        /** apm_region8_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t apm_region8_r2_pms_w:1;
        /** apm_region8_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t apm_region8_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region8_pms_attr_reg_t;

/** Type of apm_region9_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** apm_region9_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t apm_region9_r0_pms_x:1;
        /** apm_region9_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t apm_region9_r0_pms_w:1;
        /** apm_region9_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t apm_region9_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** apm_region9_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t apm_region9_r1_pms_x:1;
        /** apm_region9_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t apm_region9_r1_pms_w:1;
        /** apm_region9_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t apm_region9_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** apm_region9_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t apm_region9_r2_pms_x:1;
        /** apm_region9_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t apm_region9_r2_pms_w:1;
        /** apm_region9_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t apm_region9_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region9_pms_attr_reg_t;

/** Type of apm_region10_pms_attr register
 *  Region access authority attribute register
 */
typedef union {
    struct {
        /** apm_region10_r0_pms_x : R/W; bitpos: [0]; default: 0;
         *  Region execute authority in REE_MODE0
         */
        uint32_t apm_region10_r0_pms_x:1;
        /** apm_region10_r0_pms_w : R/W; bitpos: [1]; default: 0;
         *  Region write authority in REE_MODE0
         */
        uint32_t apm_region10_r0_pms_w:1;
        /** apm_region10_r0_pms_r : R/W; bitpos: [2]; default: 0;
         *  Region read authority in REE_MODE0
         */
        uint32_t apm_region10_r0_pms_r:1;
        uint32_t reserved_3:1;
        /** apm_region10_r1_pms_x : R/W; bitpos: [4]; default: 0;
         *  Region execute authority in REE_MODE1
         */
        uint32_t apm_region10_r1_pms_x:1;
        /** apm_region10_r1_pms_w : R/W; bitpos: [5]; default: 0;
         *  Region write authority in REE_MODE1
         */
        uint32_t apm_region10_r1_pms_w:1;
        /** apm_region10_r1_pms_r : R/W; bitpos: [6]; default: 0;
         *  Region read authority in REE_MODE1
         */
        uint32_t apm_region10_r1_pms_r:1;
        uint32_t reserved_7:1;
        /** apm_region10_r2_pms_x : R/W; bitpos: [8]; default: 0;
         *  Region execute authority in REE_MODE2
         */
        uint32_t apm_region10_r2_pms_x:1;
        /** apm_region10_r2_pms_w : R/W; bitpos: [9]; default: 0;
         *  Region write authority in REE_MODE2
         */
        uint32_t apm_region10_r2_pms_w:1;
        /** apm_region10_r2_pms_r : R/W; bitpos: [10]; default: 0;
         *  Region read authority in REE_MODE2
         */
        uint32_t apm_region10_r2_pms_r:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} hp_apm_region10_pms_attr_reg_t;

